Revit 2027 API
BuiltInFailures.FamilyFailures.CannotRotateElement Property
 Can't rotate element into this position.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotRotateElement { get; }
Public Shared ReadOnly Property CannotRotateElement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotRotateElement {
	FailureDefinitionId^ get ();
}
static member CannotRotateElement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace